IDEA StatiCa Open Model
Polygon2D.Points Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of polygon points
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<Point2D> Points { get; set; }
Public Property Points As List(Of Point2D)
	Get
	Set
public:
property List<Point2D^>^ Points {
	List<Point2D^>^ get ();
	void set (List<Point2D^>^ value);
}
Property Value
Type: List<Point2D>
See Also
Reference
Polygon2D Class
IdeaRS.OpenModel.Geometry2D Namespace